# CannotCopyHostedLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LoadFailures..::..CannotCopyHostedLoad Property
BuiltInFailures..::..LoadFailures Class See Also
---
Can't copy Load based on the Host Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyHostedLoad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyHostedLoad As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyHostedLoad {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace